import java.util.Scanner;

public class p12_Valleyball {
    public static void main(String[] args) {

        Scanner scan = new Scanner(System.in);

        String year = scan.nextLine().toLowerCase();
        int p = Integer.parseInt(scan.nextLine());
        int h = Integer.parseInt(scan.nextLine());

        double resultSofia = 0.0;
        double resultTown = 0.0;
        double holidaySofia = 0.0;
        double result1 = 0.0;
        double bonus = 0.0;

        if (year.equals("leap")) {
            resultSofia = (48 - h) * 0.75;
            resultTown = h;
            holidaySofia = p * 0.6666666667;
            result1 = resultSofia + resultTown + holidaySofia;
            bonus = (result1 * 0.15) + result1;
            System.out.printf("%.0f", Math.floor(bonus));
        } else if (year.equals("normal")) {
            resultSofia = (48 - h) * 0.75;
            resultTown = h;
            holidaySofia = p * 0.6666666667;
            result1 = resultSofia + resultTown + holidaySofia;
            System.out.printf("%.0f", Math.floor(result1));
        }
    }
}
/*
Влади е студент, живее в София и си ходи от време на време до родния град. Той е много запален по волейбола, но е зает през работните дни и играе волейбол само през уикендите и в празничните дни. Влади играе в София всяка събота, когато не е на работа и не си пътува до родния град, както и в 2/3 от празничните дни. Той пътува до родния си град h пъти в годината, където играе волейбол със старите си приятели в неделя. Влади не е на работа 3/4 от уикендите, в които е в София. Отделно, през високосните години Влади играе с 15% повече волейбол от нормалното. Приемаме, че годината има точно 48 уикенда, подходящи за волейбол.
Напишете програма, която изчислява колко пъти Влади е играл волейбол през годината. Закръглете резултата надолу до най-близкото цяло число (например 2.15  2; 9.95  9).
Входните данни се въвеждат от потребителя, в следния вид:
•	Първият ред съдържа думата „leap“ (високосна година) или „normal“ (невисокосна).
•	Вторият ред съдържа цялото число p – брой празници в годината (които не са събота и неделя).
•	Третият ред съдържа цялото число h – брой уикенди, в които Влади си пътува до родния град.
Подсказки:
•	Пресметнете уикендите в София (48 минус уикендите в родния град). Пресметнете броя игри в уикендите в София: умножете уикендите в София с (3.0 / 4). Обърнете внимание, че трябва да се използва дробно деление (3.0 / 4), а не целочислено (3 / 4).
•	Пресметнете броя игри в родния град. Те са точно колкото са пътуванията до родния град.
•	Пресметнете броя игри в празничен ден. Те са броя празници умножени по (2.0 / 3).
•	Сумирайте броя на всички игри. Той е дробно число. Не бързайте да закръгляте още.
•	Ако годината е високосна, добавете 15% към общия брой игри.
•	Накрая закръглете надолу до най-близкото цяло число с Math.floor(result).
 */