import java.util.Scanner;

public class p18_Sum_or_Multiplication {
    public static void main(String[] args) {

        Scanner scan = new Scanner(System.in);


        int control = Integer.parseInt(scan.nextLine());
        boolean found = false;

        for (int a = 1; a <= 30; a++)
            for (int b = 1; b <= 30; b++)
                for (int c = 1; c <= 30; c++) {
                    if (a + b + c == control && a < b && b < c) {
                        found = true;
                        System.out.printf("%d + %d + %d = %d%n", a, b, c, control);
                        //Console.WriteLine($"{a} + {b} + {c} = {control}");
                    }
                    if (a * b * c == control && a > b && b > c) {
                        found = true;
                        System.out.printf("%d * %d * %d = %d%n", a, b, c, control);
                        //Console.WriteLine($"{a} * {b} * {c} = {control}");
                    }
                }

        if (!found) {
            System.out.println("No!");
        }
    }
}

/*
От конзолата се чете едно цяло число – контролно. Трябва да се отпечатат в определен формат всички тройки числа (a, b и c) в интервала от 1 до 30 включително, чиито сбор или произведение е равен на контролното число. Като трябва да бъдат спазени следните условия:
•	при намирането на сбора: a < b < c
•	при намиране на произведението: a > b > c.
В случай, че НЕ са намерени такива числа трябва да отпечатаме No.

Например при контролно число 18:
Отпечатваме
•	1 + 2 + 15 = 18 (a < b < c)
•	…
•	6 * 3 * 1 = 18 ( а > b > c)
•	…
НЕ отпечатваме
•	1 + 1 + 16 = 18; 1 + 10 + 7 = 18 защото не е спазено условието (a < b < c);
•	1 * 2 * 9 = 18; 2 * 1 * 9 = 18 защото не е спазено условието (a > b > c).

Вход
От конзолата се четe 1 цяло число: N – цяло число в интервала [1 … 30000];
Изход
Отпечатването на конзолата зависи от резултата:
•	Ако са намерени тройки числа (a < b < c), сборът, на които е равен на контролното число отпечатваме:
o	“{а} + {b} + {c} = {N}”
•	Ако са намерени тройки числа (a > b > c), произведението, на които е равно на контролното число отпечатваме:
o	“{а} * {b} * {c} = {N}”
•	Ако НЕ са намерени такива числа отпечатваме:
o	“No!”
Всички комбинации се принтират в нарастващ ред.
 */